////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование"
//
// 
// 
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс


Функция ВыполнитьЗаписьЛога(СтруктураЛога, ТекстОшибки = "", Отказ = Ложь)Экспорт 
	
	Возврат ЛогированиеСервер.ВыполнитьЗаписьЛогаСервер(СтруктураЛога, ТекстОшибки = "", Отказ = Ложь);
		
КонецФункции


#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

//ПолучитьЗначениеКонстанту
//TODO Заменить на имеющийся аналог
Функция ПолучитьЗначениеКонстанты(Имя)Экспорт 
	
	Попытка
		ЗначениеКонстанты = Константы[Имя].Получить()
	Исключение
		ЗначениеКонстанты = Неопределено;
	КонецПопытки;
	
	Возврат ЗначениеКонстанты;
	
КонецФункции

//ПолучитьСтруктуруПараметровПодключенияКИБ
Функция ПолучитьСтруктуруПараметровПодключенияКИБ()Экспорт 
	Возврат ОбщегоНазначения.КонструкторСтруктурыПараметровПодключения();
КонецФункции

//ПолучитьСиноноимКонфигурации
Функция ПолучитьСиноноимКонфигурации()Экспорт 
	Возврат Метаданные.Синоним;
КонецФункции

//ПолучитьПолноеИмяТекущегоПользователяИБ
Функция ПолучитьПолноеИмяТекущегоПользователяИБ()Экспорт 
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
КонецФункции

//НомерСеансаИнформационнойБазыСтрокой
Функция НомерСеансаИнформационнойБазыСтрокой()Экспорт 
	Возврат Формат(ПолучитьНомерСеансаИнформационнойБазы(), "ЧГ=0");
КонецФункции

//НомерСеансаИнформационнойБазы
Функция ПолучитьНомерСеансаИнформационнойБазы()Экспорт 
	Возврат НомерСеансаИнформационнойБазы();
КонецФункции




#КонецОбласти



#Область СлужебныеПроцедурыИФункции



#КонецОбласти
