////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование"
//
// 
// 
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс




#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс


// КонструкторСтруктурыСлужебныхПолейЛога
// Формирует структуру служебных полей лога для Информационной базы.
//
// Возвращаемое значение:
//	Структура	- Служебные поля лога.
//		* host		- Строка - Сервер.
//		* _app		- Строка - Имя приложения.
//		* _node		- Строка - Экземпляр ИБ (Применительно к СПО "Пегас" - Узел обмена).
//		* _branch	- Строка - Структурная единица ИБ (Применительно к СПО "Пегас" - Филиал ИБ).
//
Функция КонструкторСтруктурыСлужебныхПолейЛога() Экспорт
	
	//Служебные полей ИБ
	СтруктураСлужебныхПолейЛога = Новый Структура();
		
	СтруктураСлужебныхПолейЛога.Вставить("host",	ОбщегоНазначения.КонструкторСтруктурыПараметровПодключения().Сервер);
	СтруктураСлужебныхПолейЛога.Вставить("_app",	Метаданные.Синоним);
	СтруктураСлужебныхПолейЛога.Вставить("_node",	"Подсистема логирования ELK: Demo"); //рсжBCP_ТекущийУзел
	СтруктураСлужебныхПолейЛога.Вставить("_branch",	"Москва Восток"); //споГородПоУмолчанию
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураСлужебныхПолейЛога);
	
КонецФункции

// КонструкторСтруктурыСеансовыхПолейЛога
// Формирует структуру сеансовых данных пользователя.
//
// Возвращаемое значение:
//	Структура	- Сеансовые данные.
//		* ИмяПользователя	- Строка - Полное имя пользователя ИБ.
//		* НомерСеанса		- Строка - Номер сеанса.
//
Функция КонструкторСтруктурыСеансовыхПолейЛога() Экспорт 

	СтруктураСеансовыхПолейЛога = Новый Структура();
	
	СтруктураСеансовыхПолейЛога.Вставить("ИмяПользователя",	ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя);
	СтруктураСеансовыхПолейЛога.Вставить("НомерСеанса",		Формат(НомерСеансаИнформационнойБазы(), "ЧГ=0"));
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураСеансовыхПолейЛога);	

КонецФункции


#КонецОбласти



#Область СлужебныеПроцедурыИФункции



#КонецОбласти
