
&НаСервере
Процедура ПолучитьСтруктуруЛогаНаСервере()
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуруЛога(Команда)
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);
	
	//Теперь на сервере
	ПолучитьСтруктуруЛогаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЛогНаСервере()
	
	ТекстОшибки = "";
	Отказ		= Ложь;
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	ЗаписатьЛог(СППЛ_Пустая, ТекстОшибки, Отказ);
	
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	ЗаписатьЛог(СППЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	ЗаписатьЛог(СППЛ_СДатой, ТекстОшибки, Отказ);
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	ЗаписатьЛог(СЛ_Пустая, ТекстОшибки, Отказ);
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ЗаписатьЛог(СЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ЗаписатьЛог(СЛ_БезДаты_СДатой, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);
	ЗаписатьЛог(СЛ_СДатой, ТекстОшибки, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЛог(Команда)
	
	ТекстОшибки = "";
	Отказ		= Ложь;
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	ЗаписатьЛог(СППЛ_Пустая, ТекстОшибки, Отказ);
	
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	ЗаписатьЛог(СППЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	ЗаписатьЛог(СППЛ_СДатой, ТекстОшибки, Отказ);
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	ЗаписатьЛог(СЛ_Пустая, ТекстОшибки, Отказ);
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ЗаписатьЛог(СЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ЗаписатьЛог(СЛ_БезДаты_СДатой, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);
	ЗаписатьЛог(СЛ_СДатой, ТекстОшибки, Отказ);
	
	//Теперь на сервере
	ОтправитьЛогНаСервере();
	
КонецПроцедуры
