
&НаСервере
Процедура ПолучитьСтруктуруЛогаНаСервере()
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуруЛога(Команда)
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);
	
	//Теперь на сервере
	ПолучитьСтруктуруЛогаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЛогНаСервере()
	
	ТекстОшибки = "";
	Отказ		= Ложь;
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	ОтправитьЛогСОбработкойСервер(СППЛ_Пустая, ТекстОшибки, Отказ);
	
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	ОтправитьЛогСОбработкойСервер(СППЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	ОтправитьЛогСОбработкойСервер(СППЛ_СДатой, ТекстОшибки, Отказ);
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	ОтправитьЛогСОбработкойСервер(СЛ_Пустая, ТекстОшибки, Отказ);
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ОтправитьЛогСОбработкойСервер(СЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ОтправитьЛогСОбработкойСервер(СЛ_БезДаты_СДатой, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);
	ОтправитьЛогСОбработкойСервер(СЛ_СДатой, ТекстОшибки, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЛог(Команда)
	
	ТекстОшибки = "";
	Отказ		= Ложь;
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
		
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	ОтправитьЛогСОбработкой(СППЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	ОтправитьЛогСОбработкой(СППЛ_СДатой, ТекстОшибки, Отказ);
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	ОтправитьЛогСОбработкой(СЛ_Пустая, ТекстОшибки, Отказ);
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ОтправитьЛогСОбработкой(СЛ_БезДаты, ТекстОшибки, Отказ);
	
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	ОтправитьЛогСОбработкой(СЛ_БезДаты_СДатой, ТекстОшибки, Отказ);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);
	ОтправитьЛогСОбработкой(СЛ_СДатой, ТекстОшибки, Отказ);
	
	//Теперь на сервере
	ОтправитьЛогНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЛогСОбработкой(СППЛ, ТекстОшибки, Отказ)
	
	Ответ = ЗаписатьЛог(СППЛ, ТекстОшибки, Отказ);
	Если Не Ответ.Результат = Истина Тогда 
		Сообщить("Лог не записан: " + Ответ.ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьЛогСОбработкойСервер(СППЛ, ТекстОшибки, Отказ)
	
	Ответ = ЗаписатьЛог(СППЛ, ТекстОшибки, Отказ);
	Если Не Ответ.Результат = Истина Тогда 
		Сообщить("Лог не записан: " + Ответ.ТекстОшибки);
	КонецЕсли;
КонецПроцедуры