
&НаСервере
Процедура ПолучитьСтруктуруЛогаНаСервере()
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуруЛога(Команда)
	
	//Структуры пользовательских полей лога
	//Пустая
	СППЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога();
	//Несколько полей, дата по умолчанию
	СППЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо");
	//Несколько полей, дата указана в ручную
	СППЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыПользовательскихПолейЛога("Все гут", "Все вообще хорошо", ТекущаяДата());
	
	//Структуры лога
	//Пустая
	СЛ_Пустая = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога("");
	
	//Несколько полей, дата по умолчанию
	СЛ_БезДаты = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	//Несколько полей, заменена относительно структуры
	СППЛ_БезДаты.ДатаСобытия = ТекущаяДата();
	СЛ_БезДаты_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_БезДаты);
	
	//Несколько полей, дата указана в ручную
	СЛ_СДатой = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СППЛ_СДатой);
	
	//Теперь на сервере
	ПолучитьСтруктуруЛогаНаСервере();
КонецПроцедуры
