
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти



#Область СлужебныеПроцедурыИФункции


Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	//
	ПараметрыСеанса.ПараметрыПодключенияКELK_Чтение = ЛогированиеКлиентСервер.КонструкторСтруктурыПараметровПодключенияКELK(Перечисления.ТипыНастроекПодключенияКELK.Чтение);
	ПараметрыСеанса.ПараметрыПодключенияКELK_Запись = ЛогированиеКлиентСервер.КонструкторСтруктурыПараметровПодключенияКELK(Перечисления.ТипыНастроекПодключенияКELK.Запись);
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли