


#Область ПрограммныйИнтерфейс



#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти



#Область СлужебныеПроцедурыИФункции


Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		//
		ПараметрыСеанса.ПараметрыПодключенияКELK_Чтение = ЛогированиеКлиентСервер.КонструкторСтруктурыПараметровПодключенияКELK(Перечисления.ТипыНастроекПодключенияКELK.Чтение);
		ПараметрыСеанса.ПараметрыПодключенияКELK_Запись = ЛогированиеКлиентСервер.КонструкторСтруктурыПараметровПодключенияКELK(Перечисления.ТипыНастроекПодключенияКELK.Запись);
	#КонецЕсли
КонецПроцедуры


#КонецОбласти