////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование"
//
// 
// 
////////////////////////////////////////////////////////////////////////////////



#Область ОбработчикиСобытийФормы


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьСписокИндексовНаСервере();
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
//Код процедур и функций
#КонецОбласти



#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ПолучитьСписокИндексов(Команда)
	ПолучитьСписокИндексовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокИндексовНаСервере()

	СтруктураОтвета = ЛогированиеСервер.ВыполнитьПолучениеИндексовСервер();
	ЗаполнитьДанныеФормыНаОсновеРезультатаЗапрос(СтруктураОтвета)
	
КонецПроцедуры


#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормыПоУмолчанию()
	ИмяКластера = "";
	Статус		= "";
	тзИндексы.Очистить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыНаОсновеРезультатаЗапрос(СтруктураОтвета)
	
	ЗаполнитьДанныеФормыПоУмолчанию();
	
	Если Не (ТипЗнч(СтруктураОтвета) = Тип("ФиксированнаяСтруктура") И ТипЗнч(СтруктураОтвета.РезультатВыполнения) = Тип("Соответствие")) Тогда 
		Возврат
	КонецЕсли;
	
	СтруктураКластера = СтруктураОтвета.РезультатВыполнения;
	
	ИмяКластера	= СтруктураКластера["cluster_name"];
	Статус		= СтруктураКластера["status"];
	
	СоответствиеИндексов = СтруктураКластера["indices"];	
	
	Если Не ТипЗнч(СоответствиеИндексов) = Тип("Соответствие") Тогда 
		Возврат
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СоответствиеИндексов Цикл 
		
		нСтрока = тзИндексы.Добавить();
		
		нСтрока.Индекс = КлючИЗначение.Ключ;
		СоответствиеПараметровИндекса = КлючИЗначение.Значение;
		
		нСтрока.Статус				= СоответствиеПараметровИндекса["status"];
		нСтрока.КоличествоШардов	= СоответствиеПараметровИндекса["number_of_shards"];
		нСтрока.КоличествоРеплик	= СоответствиеПараметровИндекса["number_of_replicas"];
		
	КонецЦикла;
//indices	
КонецПроцедуры



#КонецОбласти







