////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование"
//
//
//
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти



#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти



#Область СлужебныеПроцедурыИФункции


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти

