
&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ИзменениеВидимостиКолоноктзРезультат(Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеВидимостиКолоноктзРезультат(Настройки)
		
	//Поля
	Для Каждого мВыбранноеПоле Из Настройки.Выбор.Элементы Цикл 
		Элементы["тзРезультат" + Строка(мВыбранноеПоле.Поле)].Видимость = мВыбранноеПоле.Использование;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытиеФормыВарианта" Тогда 
		ИзменениеВидимостиКолоноктзРезультат(Параметр);
	КонецЕсли;
	
КонецПроцедуры
