////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование"
//
// Глобальный модуль.
// Содержит точки входа для работы с логами.
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс


// ЗаписатьЛог
// Единая точка входа для функций записи логов.
//
// Параметры:
//	СтруктураПользовательскихПолей	- Структура	- Коллекция пользовательских полей лога.
//	ТекстОшибки						- Строка	- Содержит описание ошибки, в случае возникновения оной.
//	Отказ							- Булево	- Признак возникновения ошибки выполнения.
//
// Возвращаемое значение:
//	Булево - ?
//
Процедура ЗаписатьЛог(СтруктураПользовательскихПолей, ТекстОшибки = "", Отказ = Ложь)Экспорт 
	
	СтруктураЛога = ЛогированиеКлиентСервер.КонструкторСтруктурыЛога(СтруктураПользовательскихПолей);
	
	ЛогированиеВызовСервера.ВыполнитьЗаписьЛога(СтруктураЛога, ТекстОшибки, Отказ);
	
КонецПроцедуры


#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

#КонецОбласти
