////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование"
//
//
//
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс



#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс


// КонструкторСтруктураЛогаGELF
// Конструктор структуры служебных полей формата GELF.
//
// Возвращаемое значение:
//	ФиксированнаяСтруктура	- Служебные поля формата GELF.
//		* version	- Строка - Версия используемого формата GELF.
//
Функция КонструкторСтруктурыЛогаGELF()Экспорт
	
	СтруктураЛогаGELF = Новый Структура;

	СтруктураЛогаGELF.Вставить("version",	"1.1");
		
	Возврат Новый ФиксированнаяСтруктура(СтруктураЛогаGELF);
	
КонецФункции

// КонструкторСтруктураУровнейЛога
// Конструктор структуры возможных уровней лога и их наименований.
//
// Возвращаемое значение:
//	ФиксированнаяСтруктура	- Уровни лога.
//		* ALL	- Число - Общее. 
//		* FATAL - Число - Критическая ошибка.
//		* ERROR - Число - Ошибка.
//		* WARN	- Число - Предупреждение.
//		* TRACE - Число - Трассировка.
//		* INFO	- Число - Информация.
//		* DEBUG - Число - Отладка.
//
Функция КонструкторСтруктурыУровнейЛога() Экспорт 
	
	СтруктураУровнейЛога = Новый Структура;
	
	СтруктураУровнейЛога.Вставить("ALL",	1); //Общее
	СтруктураУровнейЛога.Вставить("FATAL",	2);	//Критическая ошибка
	СтруктураУровнейЛога.Вставить("ERROR",	3);	//Ошибка
	СтруктураУровнейЛога.Вставить("WARN",	4);	//Предупреждение
	СтруктураУровнейЛога.Вставить("TRACE",	5);	//Трассировка
	СтруктураУровнейЛога.Вставить("INFO",	6);	//Информация
	СтруктураУровнейЛога.Вставить("DEBUG",	7);	//Отладка
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураУровнейЛога);
	
КонецФункции


#КонецОбласти



#Область СлужебныеПроцедурыИФункции

#КонецОбласти
